# GetConnectedElementIds Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralConnectionHandler..::..GetConnectedElementIds Method
StructuralConnectionHandler Class See Also
---
Retrieves list of element ids of connected elements.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public IList<ElementId> GetConnectedElementIds()
```

Visual Basic
---
```text
Public Function GetConnectedElementIds As IList(Of ElementId)
```

Visual C++
---
```text
public:
IList<ElementId^>^ GetConnectedElementIds()
```

# ### Return Value
Returns connected element ids.
# See Also
StructuralConnectionHandler Class
Autodesk.Revit.DB.Structure Namespace